# Pandas Practice

In [2]:
import pandas as pd

**Level: 01 Easy**

Create a Pandas Series from a Python list.

In [14]:
lst = [12,34,'Harsh','9905011725',67]

df = pd.Series(lst)
df

0            12
1            34
2         Harsh
3    9905011725
4            67
dtype: object

Create a DataFrame using a dictionary containing lists.

In [13]:
data = {
    'Name':['Harsh Kumar','Aashiish Kumar','Shalini Kimari','Raushan Kumar','Amrita Kumari'],
    'Age':[19,17,22,25,24],
    'Study':[True,True,True,True,False]
}

df = pd.DataFrame(data)
df

             Name  Age  Study
0     Harsh Kumar   19   True
1  Aashiish Kumar   17   True
2  Shalini Kimari   22   True
3   Raushan Kumar   25   True
4   Amrita Kumari   24  False

Create a DataFrame from a list of tuples.

In [16]:
data = [('Harsh',19),('Aashish',20),('Shalini',24)]

df = pd.DataFrame(data,columns=['Name','Age'])
df

      Name  Age
0    Harsh   19
1  Aashish   20
2  Shalini   24

Load a CSV file into a DataFrame.

In [197]:
sale_df = pd.read_csv('sales_data_sample.csv',encoding='latin1')
df.head(10)
df.tail(5)

           Name  Age  Roll No Enrollment No
3    Ravi kumar   22      154  A45349524154
4    Sparsh Avi   19      155  A45349524155
5   Rishi kumar   23      156  A45349524156
6   Anmol kumar   18      157  A45349524157
7  Aditya kumar   19      158  A45349524158

Print column names of a DataFrame.

In [198]:
print(sale_df.columns)

Index(['ORDERNUMBER', 'QUANTITYORDERED', 'PRICEEACH', 'ORDERLINENUMBER',
       'SALES', 'ORDERDATE', 'STATUS', 'QTR_ID', 'MONTH_ID', 'YEAR_ID',
       'PRODUCTLINE', 'MSRP', 'PRODUCTCODE', 'CUSTOMERNAME', 'PHONE',
       'ADDRESSLINE1', 'ADDRESSLINE2', 'CITY', 'STATE', 'POSTALCODE',
       'COUNTRY', 'TERRITORY', 'CONTACTLASTNAME', 'CONTACTFIRSTNAME',
       'DEALSIZE'],
      dtype='object')

Get total rows and columns in a DataFrame.

In [199]:
print(sale_df.shape)   # (rows, columns)

(2823, 25)

Check data types of all columns.

In [200]:
# df.info()
sale_df.dtypes

ORDERNUMBER           int64
QUANTITYORDERED       int64
PRICEEACH           float64
ORDERLINENUMBER       int64
SALES               float64
ORDERDATE            object
STATUS               object
QTR_ID                int64
MONTH_ID              int64
YEAR_ID               int64
PRODUCTLINE          object
MSRP                  int64
PRODUCTCODE          object
CUSTOMERNAME         object
PHONE                object
ADDRESSLINE1         object
ADDRESSLINE2         object
CITY                 object
STATE                object
POSTALCODE           object
COUNTRY              object
TERRITORY            object
CONTACTLASTNAME      object
CONTACTFIRSTNAME     object
DEALSIZE             object
dtype: object

Convert a DataFrame to a NumPy array.

In [69]:
arr = df.to_numpy()
arr

array([[10107, 30, 95.7, ..., 'Yu', 'Kwai', 'Small'],
       [10121, 34, 81.35, ..., 'Henriot', 'Paul', 'Small'],
       [10134, 41, 94.74, ..., 'Da Cunha', 'Daniel', 'Medium'],
       ...,
       [10386, 43, 100.0, ..., 'Freyre', 'Diego', 'Medium'],
       [10397, 34, 62.24, ..., 'Roulet', 'Annette', 'Small'],
       [10414, 47, 65.52, ..., 'Yoshido', 'Juri', 'Medium']],
      shape=(2823, 25), dtype=object)

**Level : 02 Medium**

Select a single column using both bracket and dot notation.

In [239]:
students = {
    "Name": ['Mantosh kumar','sumant kumar','Prashant kuamr',None,'Sparsh Avi','Rishi kumar','Anmol kumar','Aditya kumar'],
    "Age": [18,20,21,22,19,23,None,19],
    "Roll No":[151,152,153,154,None,156,157,158]

}
df = pd.DataFrame(students)

In [215]:
df['Age'] # bracket
df.Age # dot notation

0    18.0
1    20.0
2    21.0
3    22.0
4    19.0
5    23.0
6     NaN
7    19.0
Name: Age, dtype: float64

In [216]:
df.loc[0]
df.iloc[1]
df.loc[2:5,['Age','Roll No']]
df.iloc[0:2,1:3]

    Age  Roll No
0  18.0    151.0
1  20.0    152.0

Filter rows where a column value is greater than a given number.

In [217]:
num = 18
dff = df.sort_values(by='Age')
dff[dff['Age']>num]

             Name   Age  Roll No
4      Sparsh Avi  19.0      NaN
7    Aditya kumar  19.0    158.0
1    sumant kumar  20.0    152.0
2  Prashant kuamr  21.0    153.0
3            None  22.0    154.0
5     Rishi kumar  23.0    156.0

Filter rows using multiple conditions (AND / OR).

In [218]:
df[(df['Roll No']>156)  & (df['Age']>18)] # And

df[(df['Roll No']>155)  | (df['Age']>18)] # And

             Name   Age  Roll No
1    sumant kumar  20.0    152.0
2  Prashant kuamr  21.0    153.0
3            None  22.0    154.0
4      Sparsh Avi  19.0      NaN
5     Rishi kumar  23.0    156.0
6     Anmol kumar   NaN    157.0
7    Aditya kumar  19.0    158.0

Add a new column calculated from existing columns

In [250]:
df['New Roll No'] = df['Roll No']

Rename one or more columns.

In [251]:
df.rename(columns={'New Roll No':'Enrollment No'},inplace=True)
df['Enrollment No'] = 'A45349524' + df['Enrollment No'].astype(str)

df

             Name        Age     Roll No                Enrollment No
0   Mantosh kumar  18.000000  151.000000               A45349524151.0
1    sumant kumar  20.000000  152.000000               A45349524152.0
2  Prashant kuamr  21.000000  153.000000               A45349524153.0
3            None  22.000000  154.000000               A45349524154.0
4      Sparsh Avi  19.000000  154.428571  A45349524154.42857142857142
5     Rishi kumar  23.000000  156.000000               A45349524156.0
6     Anmol kumar  20.285714  157.000000               A45349524157.0
7    Aditya kumar  19.000000  158.000000               A45349524158.0

Drop a column permanently from a DataFrame.

In [279]:
# df.drop(columns=[(3, 'Name')],inplace=True)
df

             Name        Age     Roll No                Enrollment No
0   Mantosh kumar  18.000000  151.000000               A45349524151.0
1    sumant kumar  20.000000  152.000000               A45349524152.0
2  Prashant kuamr  21.000000  153.000000               A45349524153.0
3      Sanju Baba  22.000000  154.000000               A45349524154.0
4      Sparsh Avi  19.000000  154.428571  A45349524154.42857142857142
5     Rishi kumar  23.000000  156.000000               A45349524156.0
6     Anmol kumar  20.285714  157.000000               A45349524157.0
7    Aditya kumar  19.000000  158.000000               A45349524158.0

Drop rows containing missing values.

In [213]:
sale_df.dropna(inplace=True)

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
10,10223,37,100.00,1,3965.66,2/20/2004 0:00,Shipped,1,2,2004,...,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,APAC,Ferguson,Peter,Medium
21,10361,20,72.55,13,1451.00,12/17/2004 0:00,Shipped,4,12,2004,...,"Monitor Money Building, 815 Pacific Hwy",Level 6,Chatswood,NSW,2067,Australia,APAC,Huxley,Adrian,Small
40,10270,21,100.00,9,4905.39,7/19/2004 0:00,Shipped,3,7,2004,...,"Monitor Money Building, 815 Pacific Hwy",Level 6,Chatswood,NSW,2067,Australia,APAC,Huxley,Adrian,Medium

Fill missing values using mean / median.

In [261]:
df[['Age','Roll No']] = df[['Age','Roll No']].fillna(df[['Age','Roll No']].mean())
df['Name'].fillna('Sanju Baba',inplace=True)
df

             Name        Age     Roll No                Enrollment No
0   Mantosh kumar  18.000000  151.000000               A45349524151.0
1    sumant kumar  20.000000  152.000000               A45349524152.0
2  Prashant kuamr  21.000000  153.000000               A45349524153.0
3     Harsh Kumar  22.000000  154.000000               A45349524154.0
4      Sparsh Avi  19.000000  154.428571  A45349524154.42857142857142
5     Rishi kumar  23.000000  156.000000               A45349524156.0
6     Anmol kumar  20.285714  157.000000               A45349524157.0
7    Aditya kumar  19.000000  158.000000               A45349524158.0

Replace specific values in a column.

In [264]:
df['Name'].replace('Harsh Kumar','Sanju Baba',inplace=True)
df

,Name,Age,Roll No,Enrollment No,"(3, Name)"
0,Mantosh kumar,18.000000,151.000000,A45349524151.0,Sanju Baba
1,sumant kumar,20.000000,152.000000,A45349524152.0,Sanju Baba
2,Prashant kuamr,21.000000,153.000000,A45349524153.0,Sanju Baba
3,Sanju Baba,22.000000,154.000000,A45349524154.0,Sanju Baba
4,Sparsh Avi,19.000000,154.428571,A45349524154.42857142857142,Sanju Baba
5,Rishi kumar,23.000000,156.000000,A45349524156.0,Sanju Baba
6,Anmol kumar,20.285714,157.000000,A45349524157.0,Sanju Baba
7,Aditya kumar,19.000000,158.000000,A45349524158.0,Sanju Baba

**Level : 03 Advance**

 Sort a DataFrame by one column in ascending order

In [282]:
df.sort_values(by=['Age'],ascending=True)

             Name        Age     Roll No                Enrollment No
0   Mantosh kumar  18.000000  151.000000               A45349524151.0
4      Sparsh Avi  19.000000  154.428571  A45349524154.42857142857142
7    Aditya kumar  19.000000  158.000000               A45349524158.0
1    sumant kumar  20.000000  152.000000               A45349524152.0
6     Anmol kumar  20.285714  157.000000               A45349524157.0
2  Prashant kuamr  21.000000  153.000000               A45349524153.0
3      Sanju Baba  22.000000  154.000000               A45349524154.0
5     Rishi kumar  23.000000  156.000000               A45349524156.0

Sort by multiple columns with different orders

In [285]:
df.sort_values(by=['Age','Roll No'],ascending=[True,False])

             Name        Age     Roll No                Enrollment No
0   Mantosh kumar  18.000000  151.000000               A45349524151.0
7    Aditya kumar  19.000000  158.000000               A45349524158.0
4      Sparsh Avi  19.000000  154.428571  A45349524154.42857142857142
1    sumant kumar  20.000000  152.000000               A45349524152.0
6     Anmol kumar  20.285714  157.000000               A45349524157.0
2  Prashant kuamr  21.000000  153.000000               A45349524153.0
3      Sanju Baba  22.000000  154.000000               A45349524154.0
5     Rishi kumar  23.000000  156.000000               A45349524156.0

Group by a column and calculate sum

In [287]:
df.groupby('Name')['Roll No'].sum()

Name
Aditya kumar      158.000000
Anmol kumar       157.000000
Mantosh kumar     151.000000
Prashant kuamr    153.000000
Rishi kumar       156.000000
Sanju Baba        154.000000
Sparsh Avi        154.428571
sumant kumar      152.000000
Name: Roll No, dtype: float64

Group by multiple columns and calculate mean

In [293]:
df.groupby(['Name','Age'])['Roll No'].sum()
df

             Name        Age     Roll No                Enrollment No
0   Mantosh kumar  18.000000  151.000000               A45349524151.0
1    sumant kumar  20.000000  152.000000               A45349524152.0
2  Prashant kuamr  21.000000  153.000000               A45349524153.0
3      Sanju Baba  22.000000  154.000000               A45349524154.0
4      Sparsh Avi  19.000000  154.428571  A45349524154.42857142857142
5     Rishi kumar  23.000000  156.000000               A45349524156.0
6     Anmol kumar  20.285714  157.000000               A45349524157.0
7    Aditya kumar  19.000000  158.000000               A45349524158.0

Apply multiple aggregations

In [294]:
df.groupby('Name')['Roll No'].agg(['mean','sum','median'])

                      mean         sum      median
Name
Aditya kumar    158.000000  158.000000  158.000000
Anmol kumar     157.000000  157.000000  157.000000
Mantosh kumar   151.000000  151.000000  151.000000
Prashant kuamr  153.000000  153.000000  153.000000
Rishi kumar     156.000000  156.000000  156.000000
Sanju Baba      154.000000  154.000000  154.000000
Sparsh Avi      154.428571  154.428571  154.428571
sumant kumar    152.000000  152.000000  152.000000

Merge Two DataFrame

In [296]:
df1 = pd.DataFrame({"ID": [1, 2, 3], "Name": ["A", "B", "C"]})
df2 = pd.DataFrame({"ID": [2, 3, 4], "Salary": [50000, 60000, 70000]})

pd.merge(df1, df2, on="ID", how="inner")

   ID Name  Salary
0   2    B   50000
1   3    C   60000

Merge using Left and Right joins

In [302]:
pd.merge(df1,df2, on='ID',how='left')
pd.merge(df1,df2,on='ID',how='right')

   ID Name
0   1    A
1   2    B
2   3    C